// 41. Выяснить являются ли три числа сторонами треугольника 



// 42. Определить сколько чисел больше 0 введено с клавиатуры

// int F42(int N)
// {
//     int count = 0;
//     for (int i = 0; i < N; i++)
//     {
//         Console.Write("Введите число: ");
//         int number = int.Parse(Console.ReadLine());
//         if (number > 0) count++;
//     }
//     return count;
// }

// Console.Write(F42(5));

// 43. Написать программу преобразования десятичного числа в двоичное



// 44. Найти точку пересечения двух прямых заданных уравнением y=kx+b, а1 k1 и а2 и k2 заданы



// 45. Показать числа Фибоначчи



// 46. Написать программу масштабирования фигуры



// 47. Написать программу копирования массива


