// 15. Дано число. Проверить кратно ли оно 7 и 23

// void Krat(int x, int a, int b)
// {
//     if (x % a == 0 && x % b == 0) Console.Write($"Число {x} кратно числам {a} и {b}.");
//     else Console.Write($"Число {x} не кратно ни одному делителю.");
// }
// Krat(161, 7, 23);

// 16. Дано число обозначающее день недели. Выяснить является номер недели выходным днём



// 17. По двум введённым числам проверять является ли одно квадратом другого
// 18. Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y
// 19. Определить номер четверти плоскости, в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
// 20. Ввести номер четверти, показать диапазоны для возможных координат
// 21. Программа проверяет пятизначное число на палиндромом.
// 22. Найти расстояние между точками в пространстве 2D/3D